Openfoam/channel395/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0 0 -0.1)
    (4 0 -0.1)
    (0 1 -0.1)
    (4 1 -0.1)
    (0 2 -0.1)
    (4 2 -0.1)
    (0 0  0.1)
    (4 0  0.1)
    (0 1  0.1)
    (4 1  0.1)
    (0 2  0.1)
    (4 2  0.1)
);

blocks
(
    hex (0 1 3 2 6 7 9 8) (40 20 1) simpleGrading (1 2.0 1)
    hex (2 3 5 4 8 9 11 10) (40 20 1) simpleGrading (1 0.5 1)
);

edges
(
);

boundary
(
    bottomWall
    {
        type            wall;
        faces           ((0 1 7 6));
    }
    topWall
    {
        type            wall;
        faces           ((4 10 11 5));
    }
    sides1_half0
    {
        type            empty;
        faces           ((0 2 3 1));
    }
    sides1_half1
    {
        type            empty;
        faces           ((6 7 9 8));
    }
    sides2_half0
    {
        type            empty;
        faces           ((2 4 5 3));
    }
    sides2_half1
    {
        type            empty;
        faces           ((8 9 11 10));
    }
    inout1_half0
    {
        type            cyclic;
        neighbourPatch  inout1_half1;
        faces           ((1 3 9 7));
    }
    inout1_half1
    {
        type            cyclic;
        neighbourPatch  inout1_half0;
        faces           ((0 6 8 2));
    }
    inout2_half0
    {
        type            cyclic;
        neighbourPatch  inout2_half1;
        faces           ((3 5 11 9));
    }
    inout2_half1
    {
        type            cyclic;
        neighbourPatch  inout2_half0;
        faces           ((2 8 10 4));
    }
);

mergePatchPairs
(
);
