Openfoam/channel395/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |

   OpenFOAM for Windows 20.09 (v1)
   Built by CFD Support, www.cfdsupport.com (based on Symscape).
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    bottomWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          40;
        startFace       3120;
    }
    topWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          40;
        startFace       3160;
    }
    sides1_half0
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          800;
        startFace       3200;
    }
    sides1_half1
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          800;
        startFace       4000;
    }
    sides2_half0
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          800;
        startFace       4800;
    }
    sides2_half1
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          800;
        startFace       5600;
    }
    inout1_half0
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          20;
        startFace       6400;
        matchTolerance  0.0001;
        neighbourPatch  inout1_half1;
        transformType   translational;
        separation      (4 0 0);
    }
    inout1_half1
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          20;
        startFace       6420;
        matchTolerance  0.0001;
        neighbourPatch  inout1_half0;
        transformType   translational;
        separation      (-4 0 0);
    }
    inout2_half0
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          20;
        startFace       6440;
        matchTolerance  0.0001;
        neighbourPatch  inout2_half1;
        transformType   translational;
        separation      (4 0 0);
    }
    inout2_half1
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          20;
        startFace       6460;
        matchTolerance  0.0001;
        neighbourPatch  inout2_half0;
        transformType   translational;
        separation      (-4 0 0);
    }
)

// ************************************************************************* //
