Openfoam/channel395/0.orig/epsilon
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 14.855;

boundaryField
{
    bottomWall
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }
    topWall
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }
    sides1_half0
    {
        type            empty;
    }
    sides2_half0
    {
        type            empty;
    }
    inout1_half0
    {
        type            cyclic;
    }
    inout2_half0
    {
        type            cyclic;
    }
    sides2_half1
    {
        type            empty;
    }
    sides1_half1
    {
        type            empty;
    }
    inout1_half1
    {
        type            cyclic;
    }
    inout2_half1
    {
        type            cyclic;
    }
}
