Openfoam/channel395/0.orig/nut
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottomWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    topWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    sides1_half0
    {
        type            empty;
    }
    sides2_half0
    {
        type            empty;
    }
    inout1_half0
    {
        type            cyclic;
    }
    inout2_half0
    {
        type            cyclic;
    }
    sides2_half1
    {
        type            empty;
    }
    sides1_half1
    {
        type            empty;
    }
    inout1_half1
    {
        type            cyclic;
    }
    inout2_half1
    {
        type            cyclic;
    }
}
